{"id": "doc1", "content": "Machine learning is a subset of artificial intelligence that enables systems to learn and improve from experience without being explicitly programmed. It focuses on developing computer programs that can access data and use it to learn for themselves.", "metadata": {"category": "ai", "length": "medium"}}
{"id": "doc2", "content": "Deep learning is part of machine learning methods based on artificial neural networks. Learning can be supervised, semi-supervised or unsupervised. Deep learning architectures have been applied to fields including computer vision, speech recognition, and NLP.", "metadata": {"category": "ai", "length": "medium"}}
{"id": "doc3", "content": "Sourdough bread is made by the fermentation of dough using naturally occurring lactobacilli and yeast. The process requires a sourdough starter, which is a fermented mixture of flour and water containing wild yeast and bacteria.", "metadata": {"category": "cooking", "length": "medium"}}
{"id": "doc4", "content": "To bake sourdough bread, you need flour, water, salt, and a sourdough starter. The process involves mixing, folding, proofing, and baking. Temperature and timing are crucial for developing flavor and texture.", "metadata": {"category": "cooking", "length": "medium"}}
{"id": "doc5", "content": "REST API design best practices include using proper HTTP methods (GET, POST, PUT, DELETE), implementing pagination, using JSON for data exchange, versioning your API, and providing clear error messages with appropriate status codes.", "metadata": {"category": "programming", "length": "medium"}}
{"id": "doc6", "content": "When designing REST APIs, follow resource-oriented architecture. Use nouns for endpoints (e.g., /users not /getUsers), implement filtering and sorting, use HATEOAS for discoverability, and document your API with OpenAPI/Swagger.", "metadata": {"category": "programming", "length": "medium"}}
{"id": "doc7", "content": "TypeScript is a strongly typed programming language that builds on JavaScript. It adds static type definitions which help catch errors early in development. TypeScript code compiles to plain JavaScript and runs anywhere JS runs.", "metadata": {"category": "programming", "length": "medium"}}
{"id": "doc8", "content": "TypeScript features include interfaces, generics, enums, union types, and decorators. It provides excellent IDE support with autocompletion, type checking, and refactoring tools. TypeScript is widely adopted in modern web development.", "metadata": {"category": "programming", "length": "medium"}}
{"id": "doc9", "content": "Word embeddings are a type of word representation that allows words with similar meaning to have similar representation. Techniques like Word2Vec, GloVe, and BERT embeddings have revolutionized natural language processing tasks.", "metadata": {"category": "ai", "length": "medium"}}
